Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry Methods
The ConnectiveGeometry type exposes the following members.
Methods
Name | Description
GetConnection
 Returns 2 connecting line segments between geometrySection1 and geometrySection2 sections, if sections are connected, otherwise returns empty list.
GetGeometryEnumerator
 Gets a new geometry sections enumerator for enumerating through the geometry sections.
GetGeometryLegSections
 Gets geometry end GeometrySections which are possible to remove.
GetNeighborSections
 Gets neighbor sections of the geometrySection inside this ConnectiveGeometry.
IsEmpty
 Checks whether the geometry is degenerate
Top
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace